import axios from 'axios'

let handler = async (m, { conn, uptime }) => {

  const horarioFecha = new Date().toLocaleString('es-CO', {
    timeZone: 'America/Bogota'
  })

  const labelTest = "𝐌𝐄𝐋𝐈𝐎𝐃𝐀𝐒 - 𝐁𝐎𝐓"
  const imgUrl = "https://cdn.dix.lat/me/b0216efd-5f4a-4f5a-97bf-b62a81d10014.jpg"
  const videoUrl = "https://cdn.dix.lat/me/be57966c-c848-4b75-ae07-89b3ddde95a4.mp4"

  let fakeQuoted = m

  try {
    const response = await axios.get(imgUrl, {
      responseType: 'arraybuffer'
    }).catch(() => null)

    if (response) {
      const thumbBuffer = response.data

      fakeQuoted = {
        key: {
          participant: '0@s.whatsapp.net',
          remoteJid: 'status@broadcast',
          fromMe: false,
          id: 'KiritoTest'
        },
        message: {
          locationMessage: {
            name: labelTest,
            jpegThumbnail: thumbBuffer
          }
        },
        participant: '0@s.whatsapp.net'
      }
    }
  } catch (e) {
    console.error(e)
  }

  let menu = `╭━━━━━━━━━━━╮
      ❖ 𝑴𝑬𝑳𝑰𝑶𝑫𝑨𝑺 𝑩𝑶𝑻 ❖
╰━━━━━━━━━━━╯

➥ ⋄ 𝐔𝐬𝐮𝐚𝐫𝐢𝐨 : @${m.sender.split('@')[0]}
➥ ⋄ 𝐂𝐫𝐞𝐚𝐝𝐨𝐫 : +573223702049
➥ ⋄ 𝐔𝐩𝐭𝐢𝐦𝐞 : ${uptime}
➥ ⋄ 𝐅𝐞𝐜𝐡𝐚 : \`\`\`${horarioFecha}\`\`\`

━━━━━━━━━━━━━━━━━━━━━━━━━━━━

  「 🐉 *𝘔𝘌𝘕𝘜 𝘗𝘙𝘐𝘕𝘊𝘐𝘗𝘈𝘓* 」  
┣━━━━━━━━━━━━━━━━━━┫
┃ ৎ٠࣪⭑📜 ⋗ *menu*
┃ ৎ٠࣪⭑📜 ⋗ *menuff*
┃ ৎ٠࣪⭑📚 ⋗ *menufreefire*
┗━━━━━━━━━━━━━━━━━━┛

  「 👥 *𝘎𝘙𝘜𝘗𝘖𝘚* 」  
┣━━━━━━━━━━━━━━━━━━┫
┃ ৎ٠࣪⭑🔇 ⋗ *mute*
┃ ৎ٠࣪⭑🔇 ⋗ *unmute*
┃ ৎ٠࣪⭑👢 ⋗ *kick* @user
┃ ৎ٠࣪⭑👻 ⋗ *fantasmas*
┃ ৎ٠࣪⭑📈 ⋗ *promote*
┃ ৎ٠࣪⭑📉 ⋗ *demote*
┃ ৎ٠࣪⭑📢 ⋗ *todos*
┃ ৎ٠࣪⭑📢 ⋗ *hidetag*
┃ ৎ٠࣪⭑📝 ⋗ *n* <texto>
┃ ৎ٠࣪⭑📊 ⋗ *encuesta*
┃ ৎ٠࣪⭑🔓 ⋗ *grupo abrir*
┃ ৎ٠࣪⭑🔓 ⋗ *grupo cerrar*
┃ ৎ٠࣪⭑⏰ ⋗ *abrirgrupoen* <horas>
┃ ৎ٠࣪⭑⏳ ⋗ *cerrargrupoen* <horas>
┃ ৎ٠࣪⭑⏰ ⋗ *horario*
┃ ৎ٠࣪⭑🔗 ⋗ *link*
┃ ৎ٠࣪⭑🗑️ ⋗ *del*
┃ ৎ٠࣪⭑🏴‍☠️ ⋗ *robargrupo*
┃ ৎ٠࣪⭑🖼️ ⋗ *setfotogrupo*
┃ ৎ٠࣪⭑✏️ ⋗ *setnamegrupo*
┃ ৎ٠࣪⭑📜 ⋗ *setreglas*
┃ ৎ٠࣪⭑👋 ⋗ *setwelcome* <texto>
┃ ৎ٠࣪⭑👋 ⋗ *setbye*
┃ ৎ٠࣪⭑🎯 ⋗ *ruletaban*
┃ ৎ٠࣪⭑🎁 ⋗ *donarsala*
┗━━━━━━━━━━━━━━━━━━┛

  「 📥 *𝘋𝘌𝘚𝘊𝘈𝘙𝘎𝘈𝘚* 」  
┣━━━━━━━━━━━━━━━━━━┫
┃ ৎ٠࣪⭑🎵 ⋗ *play* <texto o link>
┃ ৎ٠࣪⭑📱 ⋗ *apk* <nombre>
┃ ৎ٠࣪⭑🎬 ⋗ *ytmp3* <link>
┃ ৎ٠࣪⭑🎬 ⋗ *ytmp4* <link>
┃ ৎ٠࣪⭑🎧 ⋗ *spotify* <texto>
┃ ৎ٠࣪⭑🎧 ⋗ *spotifysearch*
┃ ৎ٠࣪⭑📸 ⋗ *instagram* <link>
┃ ৎ٠࣪⭑📸 ⋗ *pinterest* <texto>
┃ ৎ٠࣪⭑🎭 ⋗ *tiktok* <link>
┃ ৎ٠࣪⭑🎭 ⋗ *tiktokmr*
┃ ৎ٠࣪⭑🎥 ⋗ *fb* <link>
┃ ৎ٠࣪⭑🐦 ⋗ *twitter* <link>
┃ ৎ٠࣪⭑📂 ⋗ *mediafire* <link>
┗━━━━━━━━━━━━━━━━━━┛

  「 🫀 *I𝘕𝘛𝘌𝘓I𝘎𝘌𝘕𝘊I𝘈 𝘈𝘙𝘛I𝘍I𝘊I𝘈𝘓* 」  
┣━━━━━━━━━━━━━━━━━━┫
┃ ৎ٠࣪⭑✨ ⋗ *meta*
┃ ৎ٠࣪⭑🌌 ⋗ *geminis*
┃ ৎ٠࣪⭑💬 ⋗ *chatgpt* <pregunta>
┃ ৎ٠࣪⭑🎨 ⋗ *imagen*
┃ ৎ٠࣪⭑👁️ ⋗ *visión*
┗━━━━━━━━━━━━━━━━━━┛

  「 🎭 *𝘚𝘛I𝘊𝘒𝘌𝘙𝘚* 」  
┣━━━━━━━━━━━━━━━━━━┫
┃ ৎ٠࣪⭑🖌️ ⋗ *qc* <texto>
┃ ৎ٠࣪⭑🎨 ⋗ *brat*
┃ ৎ٠࣪⭑🎨 ⋗ *bratv*
┃ ৎ٠࣪⭑😀 ⋗ *emojimix*
┃ ৎ٠࣪⭑🏷️ ⋗ *wm* <texto>
┃ ৎ٠࣪⭑🌟 ⋗ *s*
┃ ৎ٠࣪⭑💩 ⋗ *scat*
┗━━━━━━━━━━━━━━━━━━┛

  「 🔄 *𝘊𝘖𝘕𝘝𝘌𝘙𝘛I𝘋𝘖𝘙𝘌𝘚* 」  
┣━━━━━━━━━━━━━━━━━━┫
┃ ৎ٠࣪⭑🔥 ⋗ *hd*
┃ ৎ٠࣪⭑🖼️ ⋗ *png*
┃ ৎ٠࣪⭑🖼️ ⋗ *toimg* <sticker>
┃ ৎ٠࣪⭑🎞️ ⋗ *togif* <video>
┃ ৎ٠࣪⭑🌐 ⋗ *tourl* <img o video>
┗━━━━━━━━━━━━━━━━━━┛

  「 🎨 *𝘌𝘋I𝘊I𝘖𝘕 & 𝘓𝘖𝘎𝘖𝘚* 」  
┣━━━━━━━━━━━━━━━━━━┫
┃ ৎ٠࣪⭑🖼️ ⋗ *img* (reply)
┃ ৎ٠࣪⭑❤️ ⋗ *logocorazon*
┃ ৎ٠࣪⭑❤️ ⋗ *logopareja*
┃ ৎ٠࣪⭑🎄 ⋗ *logosad*
┃ ৎ٠࣪⭑🐉 ⋗ *logodragonball*
┃ ৎ٠࣪⭑🐉 ⋗ *logonube*
┃ ৎ٠࣪⭑🐱 ⋗ *logagatito*
┃ ৎ٠࣪⭑🦾 ⋗ *logoguerrero*
┃ ৎ٠࣪⭑🍥 ⋗ *logonaruto*
┃ ৎ٠࣪⭑🚀 ⋗ *logofuturista*
┃ ৎ٠࣪⭑🚀 ⋗ *logocielo*
┃ ৎ٠࣪⭑🎨 ⋗ *logagraffiti3d*
┃ ৎ٠࣪⭑🎨 ⋗ *logamatrix*
┃ ৎ٠࣪⭑👻 ⋗ *logohorror*
┃ ৎ٠࣪⭑👻 ⋗ *logoalas*
┃ ৎ٠࣪⭑🏆 ⋗ *logogaming*
┃ ৎ٠࣪⭑🏆 ⋗ *logosolitario*
┃ ৎ٠࣪⭑🎮 ⋗ *logochicagamer*
┃ ৎ٠࣪⭑🎮 ⋗ *logopubg*
┃ ৎ٠࣪⭑🎮 ⋗ *logolol*
┃ ৎ٠࣪⭑👾 ⋗ *logoamongus*
┃ ৎ٠࣪⭑📖 ⋗ *logoportadaff*
┃ ৎ٠࣪⭑🐅 ⋗ *logovideointro*
┃ ৎ٠࣪⭑🎬 ⋗ *logovideogaming*
┗━━━━━━━━━━━━━━━━━━┛

  「 🎮 *𝘍𝘙𝘌𝘌 𝘍I𝘙𝘌 & 𝘙𝘌𝘎𝘓𝘈𝘚* 」  
┣━━━━━━━━━━━━━━━━━━┫
┃ ৎ٠࣪⭑⚔️ ⋗ *4vs4*
┃ ৎ٠࣪⭑⚔️ ⋗ *6vs6*
┃ ৎ٠࣪⭑⚔️ ⋗ *8vs8*
┃ ৎ٠࣪⭑⚔️ ⋗ *12vs12*
┃ ৎ٠࣪⭑⚔️ ⋗ *16vs16*
┃ ৎ٠࣪⭑🟦 ⋗ *cuadrilatero*
┃ ৎ٠࣪⭑🛑 ⋗ *hexagonal* 
┃ ৎ٠࣪⭑🔐 ⋗ *interna*
┃ ৎ٠࣪⭑🏝️ ⋗ *bermuda*
┃ ৎ٠࣪⭑💣 ⋗ *guerra*
┃ ৎ٠࣪⭑📜 ⋗ *reglasclk*
┃ ৎ٠࣪⭑📜 ⋗ *reglasword*
┗━━━━━━━━━━━━━━━━━━┛

  「 🎠 *𝘋I𝘕𝘈𝘔I𝘊𝘈𝘚 𝘛𝘈𝘎* 」  
┣━━━━━━━━━━━━━━━━━━┫
┃ ৎ٠࣪⭑🔥 ⋗ *penetrar* <tag>
┃ ৎ٠࣪⭑💥 ⋗ *golpear* <tag>
┃ ৎ٠࣪⭑🤗 ⋗ *abrazar* <tag>
┃ ৎ٠࣪⭑😈 ⋗ *coger* <tag>
┃ ৎ٠࣪⭑😘 ⋗ *besar* <tag>
┃ ৎ٠࣪⭑🔥 ⋗ *follar* <tag>
┃ ৎ٠࣪⭑👋 ⋗ *saludar* <tag>
┃ ৎ٠࣪⭑💃 ⋗ *bailar* <tag>
┃ ৎ٠࣪⭑🍲 ⋗ *cenar* <tag>
┃ ৎ٠࣪⭑😡 ⋗ *angry* <tag>
┃ ৎ٠࣪⭑😤 ⋗ *enojado* <tag>
┃ ৎ٠࣪⭑🥱 ⋗ *aburrido* <tag>
┃ ৎ٠࣪⭑👏 ⋗ *aplaudir* <tag>
┃ ৎ٠࣪⭑😭 ⋗ *llorar* <tag>
┃ ৎ٠࣪⭑🍺 ⋗ *borracho* <tag>
┃ ৎ٠࣪⭑🍔 ⋗ *comer* <tag>
┃ ৎ٠࣪⭑👋 ⋗ *palmada* <tag>
┃ ৎ٠࣪⭑🥳 ⋗ *feliz* <tag>
┃ ৎ٠࣪⭑💀 ⋗ *matar* <tag>
┃ ৎ٠࣪⭑😂 ⋗ *reirse* <tag>
┃ ৎ٠࣪⭑💥 ⋗ *bofetada* <tag>
┃ ৎ٠࣪⭑💤 ⋗ *sleep* <tag>
┃ ৎ٠࣪⭑🛌 ⋗ *dormir* <tag>
┃ ৎ٠࣪⭑👣 ⋗ *pisar* <tag>
┃ ৎ٠࣪⭑🤔 ⋗ *pensar* <tag>
┃ ৎ٠࣪⭑🤰 ⋗ *embarazar* <tag>
┃ ৎ٠࣪⭑🏃 ⋗ *correr* <tag>
┃ ৎ٠࣪⭑🥺 ⋗ *sad* <tag>
┃ ৎ٠࣪⭑😢 ⋗ *triste* <tag>
┃ ৎ٠࣪⭑😨 ⋗ *asustada/o* <tag>
┃ ৎ٠࣪⭑😳 ⋗ *timido/a* <tag>
┃ ৎ٠࣪⭑🚶 ⋗ *caminar* <tag>
┃ ৎ٠࣪⭑🎭 ⋗ *drama* <tag>
┃ ৎ٠࣪⭑😉 ⋗ *guiñar* <tag>
┃ ৎ٠࣪⭑😎 ⋗ *presumir* <tag>
┃ ৎ٠࣪⭑🙂 ⋗ *sonreir* <tag>
┃ ৎ٠࣪⭑🤝 ⋗ *mano* <tag>
┃ ৎ٠࣪⭑👊 ⋗ *bullying* <tag>
┃ ৎ٠࣪⭑👋 ⋗ *hola* <tag>
┗━━━━━━━━━━━━━━━━━━┛

  「 🧩 *𝘑𝘜𝘌𝘎𝘖𝘚 & 𝘋I𝘓𝘌𝘔𝘈𝘚* 」  
┣━━━━━━━━━━━━━━━━━━┫
┃ ৎ٠࣪⭑❓ ⋗ *acertijo*
┃ ৎ٠࣪⭑❓ ⋗ *pregunta*
┃ ৎ٠࣪⭑❓ ⋗ *reto*
┃ ৎ٠࣪⭑🎲 ⋗ *dado*
┃ ৎ٠࣪⭑🛌 ⋗ *consejo*
┃ ৎ٠࣪⭑🛌 ⋗ *piropo*
┃ ৎ٠࣪⭑🔍 ⋗ *doxear*
┃ ৎ٠࣪⭑🤝 ⋗ *casar*
┃ ৎ٠࣪⭑🤝 ⋗ *divorcio*
┃ ৎ٠࣪⭑🤝 ⋗ *matrimonios*
┃ ৎ٠࣪⭑👫 ⋗ *formarpareja*
┃ ৎ٠࣪⭑👫 ⋗ *love* <tag>
┃ ৎ٠࣪⭑😍 ⋗ *minovia* <tag>
┃ ৎ٠࣪⭑😍 ⋗ *minovio* <tag>
┃ ৎ٠࣪⭑💍 ⋗ *sernovios* <tag>
┃ ৎ٠࣪⭑💖 ⋗ *enamorar* <tag>
┃ ৎ٠࣪⭑💕 ⋗ *amor* <tag>
┃ ৎ٠࣪⭑📊 ⋗ *topparejas*
┃ ৎ٠࣪⭑🤝 ⋗ *amistad*
┃ ৎ٠࣪⭑😍 ⋗ *enamorada*
┃ ৎ٠࣪⭑🔥 ⋗ *violar*
┃ ৎ٠࣪⭑🔥 ⋗ *horny*
┃ ৎ٠࣪⭑👑 ⋗ *top* <texto>
┃ ৎ٠࣪⭑👿 ⋗ *cachudo/a*
┃ ৎ٠࣪⭑😬 ⋗ *feo/a*
┃ ৎ٠࣪⭑🌈 ⋗ *gay*
┃ ৎ٠࣪⭑🌈 ⋗ *lesbiana*
┃ ৎ٠࣪⭑🐵 ⋗ *pajero/a*
┃ ৎ٠࣪⭑🐵 ⋗ *enano/a*
┃ ৎ٠࣪⭑🇵🇪 ⋗ *peruano/a*
┃ ৎ٠࣪⭑🇵🇪 ⋗ *rata*
┃ ৎ٠࣪⭑😈 ⋗ *puto/a*
┃ ৎ٠࣪⭑😈 ⋗ *prostituta/o*
┃ ৎ٠࣪⭑✊🏿 ⋗ *negro/a*
┃ ৎ٠࣪⭑✊🏿 ⋗ *adoptado/a*
┃ ৎ٠࣪⭑🤕 ⋗ *manco/a*
┗━━━━━━━━━━━━━━━━━━┛

  「 🥀 *𝘍𝘙𝘈𝘚𝘌𝘚* 」  
┣━━━━━━━━━━━━━━━━━━┫
┃ ৎ٠࣪⭑🥀 ⋗ *fraseromantica*
┃ ৎ٠࣪⭑👤 ⋗ *personalidad* <tag>
┃ ৎ٠࣪⭑📜 ⋗ *frases*
┃ ৎ٠࣪⭑📸 ⋗ *camara*
┃ ৎ٠࣪⭑📣 ⋗ *facto*
┗━━━━━━━━━━━━━━━━━━┛

  「 ⚙️ *𝘊𝘖𝘕𝘍I𝘎𝘜𝘓𝘈𝘊I𝘖𝘕 / 𝘖𝘕-𝘖𝘍𝘍* 」  
┣━━━━━━━━━━━━━━━━━━┫
┃ ৎ٠࣪⭑⚙️ ⋗ *on/off welcome*
┃ ৎ٠࣪⭑⚙️ ⋗ *on/off nsfw*
┃ ৎ٠࣪⭑⚙️ ⋗ *on/off antilink*
┃ ৎ٠࣪⭑⚙️ ⋗ *on/off antiarabes*
┃ ৎ٠࣪⭑⚙️ ⋗ *on/off detect*
┃ ৎ٠࣪⭑⚙️ ⋗ *on/off modoadmin*
┃ ৎ٠࣪⭑⚙️ ⋗ *enable*
┃ ৎ٠࣪⭑⚙️ ⋗ *disable*
┗━━━━━━━━━━━━━━━━━━┛

  「 👑 *𝘊𝘙𝘌𝘈𝘋𝘖𝘓 / 𝘖𝘞𝘕𝘌𝘙* 」  
┣━━━━━━━━━━━━━━━━━━┫
┃ ৎ٠࣪⭑📡 ⋗ *ping*
┃ ৎ٠࣪⭑📡 ⋗ *runtime* / *tiempo*
┃ ৎ٠࣪⭑👤 ⋗ *creador*
┃ ৎ٠࣪⭑🔄 ⋗ *update*
┃ ৎ٠࣪⭑🔄 ⋗ *reiniciar* / *estado*
┃ ৎ٠࣪⭑🔑 ⋗ *join*
┃ ৎ٠࣪⭑👑 ⋗ *dameadmin* / *tenerpoder*
┃ ৎ٠࣪⭑⛔ ⋗ *banchat*
┃ ৎ٠࣪⭑⛔ ⋗ *unbanchat*
┃ ৎ٠࣪⭑🤖 ⋗ *setfotobot*
┃ ৎ٠࣪⭑🏷️ ⋗ *setbotname* / *setnamebot*
┃ ৎ٠࣪⭑📡 ⋗ *on antiprivado*
┃ ৎ٠࣪⭑📡 ⋗ *autoadmin*
┃ ৎ٠࣪⭑💡 ⋗ *lista grupos*
┃ ৎ٠࣪⭑🌐 ⋗ *salir*
┗━━━━━━━━━━━━━━━━━━┛

> © 𝑴𝑬𝑳𝑰𝑶𝑫𝑨𝑺 𝑩𝑶𝑻 𝖝 𝖩𝗎𝖺enan-𝗓`

  await conn.sendMessage(
    m.chat,
    {
      video: { url: videoUrl },
      gifPlayback: true,
      caption: menu,
      mentions: [m.sender],
      contextInfo: {
        forwardingScore: 1,
        isForwarded: true,
        forwardedNewsletterMessageInfo: {
          newsletterJid: global.ch || '120363419404216418@newsletter',
          newsletterName: '↯ 𝘔𝘌𝘓I𝘖𝘋𝘈𝘚 𝘉𝘖𝘛 - 𝘊𝘏𝘈𝘕𝘕𝘌𝘓 𝟮𝟬𝟮𝟯'
        }
      }
    },
    { quoted: fakeQuoted }
  )
}

handler.help = ['menu']
handler.tags = ['main']
handler.command = ['menu']

export default handler
